Catalogs/ФормыРасчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Catalog>
		<Properties>
			<Name>ФормыРасчета</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновнойБанковскийСчет</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СписокПодразделений</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Подразделение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ОрганизацииПоСумме</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СуммаДо</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Организация</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Организации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>БанковскийСчет</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДействуетС</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/ФормыРасчета/Ext/ObjectModule.bsl
// Дата "Діє з" у строк таблицы лимитов ОрганизацииПоСумме.
// С этого момента для ступени строки заново считаются заказы при выборе счёта
// (БП_ОбщийМодуль.СтрокаСНаименьшимЧисломЗаказов): иначе счёт, добавленный посреди дня,
// получал бы подряд все заказы, пока не догонит остальные.
// Дата ставится строке, которой не было в прежней версии элемента, - новой или изменённой
// (другая сумма, организация или счёт). Перестановка строк дату не трогает.

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка тогда
		Возврат;
	КонецЕсли;
	
	ПрежниеСтроки = Неопределено;
	Если Не ЭтоНовый() тогда
		ПрежниеСтроки = Ссылка.ОрганизацииПоСумме.Выгрузить();
	КонецЕсли;
	
	Для каждого СтрокаЛимита Из ОрганизацииПоСумме Цикл
		
		СтрокаБылаРаньше = Ложь;
		Если ПрежниеСтроки <> Неопределено тогда
			Отбор = Новый Структура("СуммаДо, Организация, БанковскийСчет",
				СтрокаЛимита.СуммаДо, СтрокаЛимита.Организация, СтрокаЛимита.БанковскийСчет);
			СтрокаБылаРаньше = ПрежниеСтроки.НайтиСтроки(Отбор).Количество() > 0;
		КонецЕсли;
		
		Если Не СтрокаБылаРаньше тогда
			СтрокаЛимита.ДействуетС = ТекущаяДата();
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры
